export const CONTENT_5 = `
<blockquote>
<p><strong>译者按</strong>：乍看上去，区块链和AI似乎并没有交集：一个是在封闭数据平台上培育中心化的智能，另一个则是在开放数据环境下促进分布化的应用。但是，要明确的是人工智能涉及多种学科，多个细分领域。所以可以确定的说，区块链和人工智能肯定有可以交叉结合的空间。区块链技术有智能合约机制，而智能合约就是一段可执行的代码。人工智能中有很多算法，这些算法肯定是可以应用到智能合约中的。另外，多技术间的融合是大势所趋。今天我们编译了本文，来看看区块链改变人工智能的可能性。</p>
</blockquote>

<p>改进人工智能的研究，已经进行了数十年。然而，直到最近，开发人员才终于能够开发出智能系统，非常类似于人类能力的人工智能。</p>


       		<blockquote>
<p>译注：人工智能的历史最早可追溯到1943年神经学家 Warren McCulloch 和数学家 Walter Pitts 合著的《神经活动中固有的思维逻辑运算》（A Logical Calculus of the Ideas Immanent in Nervous Activity），详情可参见AI前线的文章《人工智能历史十大里程碑》（<a href="http://mp.weixin.qq.com/s/MvPK3xxfR3vsvaia3pN7DA">http://mp.weixin.qq.com/s/MvPK3xxfR3vsvaia3pN7DA</a>）</p>
</blockquote>

<p>这一技术的突破主要得益于大数据的进步。最近大数据的发展，使得我们具备了将大量信息组织成结构化组件的能力，这些组件可以通过计算机快速处理。</p>


       		<blockquote>
<p>译注：人工智能和大数据的关系，可以打一个不太恰当的比方：把人工智能看成一个嗷嗷待哺拥有无限潜力的婴儿，某一领域专业的海量的、深度的数据就是喂养这个天才的奶粉。奶粉的数量决定了婴儿是否能长大，而奶粉的质量则决定了婴儿后续的智力发育水平。大数据的本质是海量的、多维度、多形式的数据。</p>
</blockquote>

<p>区块链是另一项有望迅速推进和改造人工智能的技术。虽然在区块链上开发的一些应用程序只不过是交易的账本记录，但其他应用非常智能，几乎就像人工智能一样。</p>

<blockquote>
<p>译注：区块链结合人工智能会带来那些落地应用，可参看区块链前哨的文章《处于风口浪尖的区块链和人工智能，联手在这些领域落地有声》（<a href="http://mp.weixin.qq.com/s/ILDlkUz8wtF7V5ZRFghOjg">http://mp.weixin.qq.com/s/ILDlkUz8wtF7V5ZRFghOjg</a>）</p>
</blockquote>

<p>在本文中，我们将更密切地关注通过区块链协议如何改进人工智能。</p>

<h3>区块链技术</h3>

<p>区块链的拥趸认为，区块链可以为众多行业带来好处。这项技术已经在金融和货币交易市场证明了它的实用性。</p>

<blockquote>
<p>译注：区块链最重要的是解决了中介信用问题。在过去，两个互不认识和信任的人要达成协作是难的，必须要依靠第三方。比如支付行为，在过去任何一种转账，必须要有银行或者支付宝这样的机构存在。但是通过区块链技术，比特币是人类第一次实现在没有任何中介机构参与的情况下，完成双方可以互信的转账行为。这是区块链的重大突破。</p>
</blockquote>

<p>抵押贷款行业可以从区块链应用程序中的贷款发放、支付和交易中受益。智能合约允许在利益相关者履行各自的合约义务时，自动化执行意外事件。</p>

<blockquote>
<p>译注：由于没有中心化的中介机构存在，让所有的东西都通过预先设定的程序自动运行，不仅能够大大降低成本，也能提高效率。而由于每个人都有相同的账本，能确保账本记录过程是公开透明的。</p>
</blockquote>

<p>像Wal-Mart这样的大型零售业正在与IBM合作，在其流程中应用区块链。他们此举旨在改善库存控制并减少浪费。基于区块链的供应链可以帮助零售商跟踪产品批次，并在商店中保持稳定供应。</p>

<blockquote>
<p>译注：可参阅IBM新闻稿《沃尔玛携手IBM利用区块链技术追踪食品供应链，打造老百姓的安全餐桌》（<a href="https://www-31.ibm.com/ibm/cn/blockchain/pdf/4b_Walmart_BlockchainChinese.pdf">https://www-31.ibm.com/ibm/cn/blockchain/pdf/4b_Walmart_BlockchainChinese.pdf</a>）</p>
</blockquote>

<p>区块链也可用于医疗保健行业，因为它可以让患者创建完全安全的医疗历史记录，而且可以通过区块链网络轻松访问。</p>

<blockquote>
<p>译注：医疗数据通常包含了患者的身份信息、治疗方案、治疗费用等敏感信息，然后医药行业又是个门槛很高的行业，一旦数据泄露，不法人员利用信息不对很容易对患者造成健康财产上的伤害。如果将这些敏感的医疗数据加密后写入区块链，不仅可以通过时间戳来确保数据精度，而且能确保数据安全，不会被没有权限的人看到，并且不会轻易被黑客攻击篡改。在安全隐私保护的同时，区块链技术可以让医疗数据以一种更安全便捷的方式来进行共享，因为区块链网络上的节点数据几乎是实时更新的，患者在A医院的治疗数据，会同步到B医院的数据库里，在患者的授权下，B医院的医生可以跟踪查看患者之前的治疗方案，这些精准的信息以一种安全共享的方式在医疗体系内流传，不仅能够节约医疗人员的时间人力成本，对患者来说，信息的公开透明，也能增加患者本身对医院、医生的信任。</p>
</blockquote>

<p>还有些人甚至认为，这项技术将在不久的将来，用于举行选举。</p>

<blockquote>
<p>译注：这一设想现已实现，非洲西部的塞拉利昂共和国今年3月份已举办首届由区块链技术支持的总统选举活动。在区块链选举中，每一笔交易就代表了一张选票，由于区块链可以防止窜改，大选结果可以完美地反映出投票情形，而不用担心被黑客袭击，或发生欺诈。至少这是区块链支持者所希望的。而塞拉利昂大选也就成了测试这些远大目标的一块试金石。</p>
</blockquote>

<p><strong>通过区块链改进人工智能。</strong></p>

<p>研究人员还研究了如何利用区块链来改进人工智能的方法。区块链开发人员很好的解释了为何分布式账本系统是测试开发下一代人工智能的完美平台。</p>

<p>现有的人工智能测试数据库在所谓的“红海”中运行，竞争很激烈，有很多类似的技术和方法正在测试，许多企业都在为增效而竞争。</p>

<blockquote>
<p>译注：红海代表当前业已存在的所有行业，这是一个已知的市场空间。在红海中，产业边界是明晰和确定的，游戏的竞争规则是已知的。身处红海的企业试图表现得超过竞争对手，以攫取已知需求下的更大市场份额。</p>
</blockquote>

<p>基于区块链的人工智能数据库代表了无可争议的市场蓝海。这是因为该技术仍然新颖、安全、透明的缘故。它有可能在未来取得伟大的成就。</p>

<blockquote>
<p>译注：蓝海意味着未开垦的市场空间、需求的创造以及利润高速增长的机会。尽管有些蓝海是在现有的红海领域之外创造出来的，但绝大多数蓝海是通过扩展已经存在的产业边界而形成的，正如太阳马戏团所做的那样。在蓝海中，竞争是无关的，因为游戏规则还有待建立。&nbsp;</p>
</blockquote>

<p>下文罗列了区块链有望成为测试和构建人工智能的有力竞争者的一些特征。</p>

<h3>分散控制和数据共享</h3>

<p>区块链在分散的节点网络上工作，共同协作来解决复杂的算法。找到最佳解决方案的网络上的挖矿节点，将该条目添加到区块链账本中。</p>

<p>人工智能也适用于类似的模型。当必须由人工智能系统来决定时，它会测试可能的解决方案，以及在第一个决策之后出现的交替分支的可能性。在人工智能选择最佳方案之前，对所有可能的备选方案进行病故，以检验最终结果。</p>

<p>区块链特别出色的地方在于，它不是以一个单一的中央系统来测试所有可能的假设，而是将这项任务划分到世界各地的数百个节点中，使得这个过程更为快速。</p>

<blockquote>
<p>译注：在区块链的基本形式中，区块链包含加密数据块的网络。这些数据不在中央位置，也不由一个特定的实体管理。相反，这些数据块被分散在全球各地的参与PC之间“链接”。这些数据不能被改变或者被黑掉，因为所有的块都有前一块的加密哈希以及它们的事务数据和时间戳。</p>
</blockquote>

<h3>额外的安全性</h3>

<p>在单个中央处理器上运行的人工智能系统很容易受到骇客攻击，因为任何不满分子都可以只需闯入单个系统来操作指令。</p>

<p>区块链平台上的条目必须经过网络上的大多数节点进行认证，然后才能被接受并处理到账本中。在网络上运行的节点数量越多，入侵系统就越困难。</p>

<p>基于区块链的人工智能平台并非固若金汤，但是操纵和破坏这样的系统，难度还是非常大的。</p>

<blockquote>
<p>译注：骇客入侵区块链，苦难程度非常大，且所需资金也很庞大。对公共区块链尤为如此。因为入侵需要控制大多数节点，而这几乎不可能。想要黑掉区块链，骇客必须掌控超过50%的参与者或区块，且这一动作要比新区块的创建快。</p>
</blockquote>

<h3>更大的信任</h3>

<p>为了可靠，一个系统必须得到公众的普遍信任。区块链比封闭的人工智能有更高的透明度。在区块链账本上保存的记录，可随时由有权访问系统的授权人员在任何时候进行审查和审核。同时，由于数据库是加密的，未获得访问授权的用户将无法查看任何内容。</p>

<p>以医疗保健行业中的区块链应用为例。患有并发症的患者可能并不希望他们的医疗记录被未经授权的人员访问。用加密的格式来保存医疗历史记录，而不是简单的英文记录，这样确保他们的记录无法被任何个人访问。</p>

<p>另一方面，在区块链上保存的记录还可确保医疗人员能够在紧急情况下通过访问文件来提供快速医疗援助。</p>

<blockquote>
<p>译注：区块链出现后，转变了传统的信息拥有模式，新的模式是基于状态而不是基于消息传递的通信。银行与交易中的各方可以近乎实时的共享交易信息，从而建立起持久的信任感。由于区块链的记录不可篡改，真实可信，人们对区块链的信任要远超中介的信任。</p>
</blockquote>

<h3>区块链将如何改变人工智能</h3>

<p>人工智能技术的发展依赖于大量来源的数据可用性。像Google、Facebook和电信公司这样的组织可以访问大量数据，这些数据对测试许多人工智能的过程非常有用。但问题是，这些数据外界无法访问。</p>

<p>这个问题可通过区块链的P2P连接来解决。区块链账本是一个公开的分布式注册表。数据库可用于网络上所有的节点。区块链可能是最好的办法，即通过允许它免费获取来终结少数几家大公司对数据的控制。</p>

<h3>现代人工智能和数据</h3>

<p>人工智能的发展取决于数据的获取方式，就好比建筑物依赖于材料、石材和钢材一样。这是因为一直需要数据来测试、重新测定人工智能的替代解决方案。</p>

<p>人工智能系统要不断测试这些假设，拒绝错误的答案，建立在正确的解决方案基础上，从而提高了对事物的理解能力，这就是我们通常所说的机器学习。</p>

<p>机器不具备人类历经数百万年来才形成的直觉，为了将来有一天，人工智能达到与人类相似的智能水平，它需要在数年内测试数百万笔交易的数据才有望达到。</p>

<blockquote>
<p>译注：所谓直觉，译者认为是人类大脑系统产中的一种强烈的深度感觉，它能察觉到某个事物已经发生了变化，即使我们的智力难以对该变化进行形象化处理，并且不能说出发生了什么变化，或哪里发生了变化。在人类千百年的进化过程中，一些对事物直接因果关系的感知能力深深地镌刻在人类的潜意识中，这被生物学家称为“适应力”。通过这种适应力，人们能够做到某种程度的“未卜先知”，从而避免受到伤害。</p>
</blockquote>

<h3>控制数据的使用</h3>

<p>这也许是人工智能发展过程中最重要的受限因素，这也是为什么区块链在没有中央式数据库的地方工作的原因。</p>

<p>看一看Facebook或Google，当用户登录他们的Facebook账户时，他们并没有将任何内容上传到他们平台的权利。平台上的内容，属于网站。</p>

<p>而区块链的不同之处在于，区块链的数据并非由运营商所有，而是由个人钱包持有者所拥有。这使得每个用户能够在平台上共享他们的数据，而无需网络运营商的许可。</p>

<p>人工智能的未来发展在于允许连接用户和运营商之间的信息自由流动的网络。区块链技术的分散性意味着它可能是我们有望在人工智能上看到极大突破的平台。</p>

`
